#!/usr/bin/python
# -*- coding: utf-8 -*-

#3.1 python 是动态语言，第一次赋值时就赋予变量类型，同时变量可以通过赋值改变变量类型

#3.2 函数本身就是一种类型，可以通过type(abs())

#3.3 因为下划线在类里有特殊用途，如私用，或者是内建函数

#3.4 语句可以书写多行 并用分行隔开，如下所示
a=12;print a

#3.5可以分几行写，有如下两种方式

a={'a':1,
            'b':2}
print a

a=\
	12
print a 

#3.6可以自行验证

#3.7 可以自行验证 其中变量必须以字母或者开头，中间可以是字母数字和下划线，其中不要随便用双下划线作为变量开头，且不能用内建关键字作为变量，另外变量对对大小写敏感，

#3.8题目不明，可以尝试从网上复制粘贴代码，然后进行修改代码，让他看起来更舒服

#3.9 目前只用过Windows 系统，等有时间玩Linux系统时，再来回答这个问题
import os

os/linesep #在windows下输入以上代码就可以看到结果

#3.10-3.14可以按要求自己输入代码